{
  "intents": [
    {
      "tag": "algorithm",
      "patterns": [
        "What is an algorithm?",
        "Explain algorithm.",
        "Define algorithm.",
        "How are algorithms used in data science?"
      ],
      "responses": [
        "An algorithm is a set of instructions or rules to follow in order to complete a specific task. Algorithms can be particularly useful when you’re working with big data or machine learning. Data analysts may use algorithms to organize or analyze data, while data scientists may use algorithms to make predictions or build models."
      ]
    },
    {
      "tag": "artificial_intelligence",
      "patterns": [
        "What is artificial intelligence?",
        "Explain artificial intelligence.",
        "Define AI.",
        "How is artificial intelligence used?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/ai-vs-deep-learning-vs-machine-learning-beginners-guide\" target=\"_self\" rel=\"\">Artificial intelligence</a> (AI) uses computer science and data to enable problem solving in machines. In this case, the intelligence is “artificial” because it’s a computer programmed to perform tasks commonly associated with human intelligence."
      ]
    },
    {
      "tag": "big_data",
      "patterns": [
        "What is big data?",
        "Explain big data.",
        "Define big data.",
        "What are the three V's of big data?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/what-is-big-data-a-laypersons-guide\" target=\"_self\" rel=\"\">Big data</a> is a large collection of data characterized by the three V’s: volume, velocity and variety. Volume refers to the amount of data—big data deals with high volumes of data; velocity refers to the rate at which data is collected—big data is collected at a high velocity and often streams directly into memory; and variety refers to the range of data formats—big data tends to have a high variety of structured, semi-structured, and unstructured data, as well as a variety of formats such as numbers, text strings, images, and audio."
      ]
    },
    {
      "tag": "business_intelligence",
      "patterns": [
        "What is business intelligence?",
        "Explain business intelligence.",
        "Define BI.",
        "How do business intelligence analysts work?"
      ],
      "responses": [
        "Business intelligence (BI) is data analytics used to empower organizations to make data-driven business decisions. <a href=\"https://www.coursera.org/articles/business-intelligence-analysts-what-they-are-and-how-to-become-one\" target=\"_self\" rel=\"\">Business intelligence analysts</a> analyze business data like revenue, sales, or customer data, and offer recommendations based on their analysis."
      ]
    },
    {
      "tag": "changelog",
      "patterns": [
        "What is a changelog?",
        "Explain changelog.",
        "Define changelog.",
        "What is the purpose of a changelog?"
      ],
      "responses": [
        "A changelog is a list documenting all of the steps you took when working with your data. This can be helpful in the event that you need to return to your original data or recall how you prepared your data for analysis."
      ]
    },
    {
      "tag": "classification",
      "patterns": [
        "What is classification?",
        "Explain classification.",
        "Define classification.",
        "What algorithms are used for classification?"
      ],
      "responses": [
        "Classification is a machine learning problem that organizes data into categories. You may use this to create email spam filters, for example. Some examples of algorithms commonly used to create classification models are logistic regression, decision trees, K-nearest neighbor (KNN), and random forest."
      ]
    },
    {
      "tag": "dashboard",
      "patterns": [
        "What is a dashboard?",
        "Explain dashboard.",
        "Define dashboard.",
        "How are dashboards used in data analysis?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/what-is-dashboard\" target=\"_self\" rel=\"\">dashboard</a> is a tool used to monitor and display live data. Dashboards are typically connected to databases and feature visualizations that automatically update to reflect the most current data in the database."
      ]
    },
    {
      "tag": "data_analytics",
      "patterns": [
        "What is data analytics?",
        "Explain data analytics.",
        "Define data analytics.",
        "What do data analytics professionals do?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/data-analytics\" target=\"_self\" rel=\"\">Data analytics</a> is the collection, transformation, and organization of data in order to draw conclusions, make predictions, and drive informed decision making. Data analytics encompasses data analysis (the process of deriving information from data), data science (using data to theorize and forecast) and data engineering (building data systems). Data analysts, data scientists, and data engineers are all data analytics professionals."
      ]
    },
    {
      "tag": "data_architecture",
      "patterns": [
        "What is data architecture?",
        "Explain data architecture.",
        "Define data design.",
        "What do data architects do?"
      ],
      "responses": [
        "Data architecture, also called data design, is the plan for an organization’s data management system. This can include all touchpoints in the data lifecycle, including how the data is gathered, organized, utilized, and discarded. <a href=\"https://www.coursera.org/articles/data-architect\" target=\"_self\" rel=\"\">Data architects</a> design the blueprints that organizations use for their data management systems."
      ]
    },
    {
      "tag": "data_cleaning",
      "patterns": [
        "What is data cleaning?",
        "Explain data cleaning.",
        "Define data cleansing.",
        "Why is data cleaning important?"
      ],
      "responses": [
        "Data cleaning, cleansing, or scrubbing is the process of preparing raw data for analysis. When cleaning your data, you verify that your data is accurate, complete, consistent, and unbiased. It’s important to make sure you have clean data prior to analysis because unclean or dirty data can lead to inaccurate conclusions and misguided business decisions."
      ]
    },
    {
      "tag": "data_engineering",
      "patterns": [
        "What is data engineering?",
        "Explain data engineering.",
        "Define data engineering.",
        "What do data engineers do?"
      ],
      "responses": [
        "Data engineering is the process of making data accessible for analysis. <a href=\"https://www.coursera.org/articles/what-does-a-data-engineer-do-and-how-do-i-become-one\" target=\"_self\" rel=\"\">Data engineers</a> build systems that collect, manage, and convert raw data into usable information. Some common tasks include developing algorithms to transform data into a more useful form, building database pipeline architectures, and creating new data analysis tools."
      ]
    },
    {
      "tag": "data_enrichment",
      "patterns": [
        "What is data enrichment?",
        "Explain data enrichment.",
        "Define data enrichment.",
        "Why is data enrichment important?"
      ],
      "responses": [
        "Data enrichment the process of is adding data to your existing dataset. You’d typically enrich your data during the data transformation process as you are getting ready to begin your analysis if you realize you need additional data in order to answer your business question."
      ]
    },
    {
      "tag": "data_governance",
      "patterns": [
        "What is data governance?",
        "Explain data governance.",
        "Define data governance.",
        "Why do organizations need data governance?"
      ],
      "responses": [
        "Data governance is the formal plan for the way an organization manages company data. Data governance encompasses rules for the way data is accessed and used and can include accountability and compliance rules."
      ]
    },
    {
      "tag": "data_lake",
      "patterns": [
        "What is a data lake?",
        "Explain data lake.",
        "Define data lake.",
        "How do data lakes differ from data warehouses?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/data-lake-vs-data-warehouse\" target=\"_self\" rel=\"\">data lake</a> is a data storage repository designed to capture and store a large amount of structured, semi-structured, and unstructured raw data. Data scientists use the data in data lakes for machine learning or AI algorithms and models, or they can process the data and transfer it to a data warehouse."
      ]
    },
    {
      "tag": "data_mart",
      "patterns": [
        "What is a data mart?",
        "Explain data mart.",
        "Define data mart.",
        "What is the difference between data mart and data warehouse?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/data-mart-vs-data-warehouse\" target=\"_self\" rel=\"\">data mart</a> is a subset of a data warehouse that houses all processed data relevant to a specific department. While a data warehouse may contain data pertaining to the finance, marketing, sales, and human resources teams, a data mart may isolate the finance team data."
      ]
    },
    {
      "tag": "data_mining",
      "patterns": [
        "What is data mining?",
        "Explain data mining.",
        "Define data mining.",
        "Why is data mining important?"
      ],
      "responses": [
        "Data mining is closely examining data to identify patterns and glean insights. Data mining is a central aspect of data analytics; the insights you find during the mining process will inform your business recommendations."
      ]
    },
    {
      "tag": "data_modeling",
      "patterns": [
        "What is data modeling?",
        "Explain data modeling.",
        "Define data modeling.",
        "What do data modelers do?"
      ],
      "responses": [
        "Data modeling is the process of mapping and building data pipelines that connect data sources for analysis. A data model is a tool that implements those pipelines and organizes data across data sources. <a href=\"https://www.coursera.org/articles/what-is-a-data-modeler\" target=\"_self\" rel=\"\">Data modelers</a> are systems analysts who work with data architects and database administrators to design databases and data systems."
      ]
    },
    {
      "tag": "data_visualization",
      "patterns": [
        "What is data visualization?",
        "Explain data visualization.",
        "Define data visualization.",
        "Why is data visualization important?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/data-visualization\" target=\"_self\" rel=\"\">Data visualization</a> is the representation of information and data using charts, graphs, maps, and other visual tools. With strong data visualizations, you can foster storytelling, make your data accessible to a wider audience, identify patterns and relationships, and explore your data further."
      ]
    },
    {
      "tag": "data_warehouse",
      "patterns": [
        "What is a data warehouse?",
        "Explain data warehouse.",
        "Define data warehouse.",
        "How is data stored in a data warehouse?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/data-warehouse\" target=\"_self\" rel=\"\">data warehouse</a> is a centralized data repository that stores processed, organized data from multiple sources. Data warehouses may contain a combination of current and historical data that has been extracted, transformed, and loaded from internal and external databases."
      ]
    },
    {
      "tag": "data_wrangling",
      "patterns": [
        "What is data wrangling?",
        "Explain data wrangling.",
        "Define data wrangling.",
        "What are the stages of data wrangling?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/data-wrangling\" target=\"_self\" rel=\"\">Data wrangling</a>, also called data munging or data remediation, is the process of converting raw data into a usable form. There are four stages of the munging process: discovery, data transformation, data validation, and publishing. The data transformation stage can be broken down further into tasks like data structuring, data normalization or denormalization, data cleaning, and data enrichment."
      ]
    },
    {
      "tag": "database",
      "patterns": [
        "What is a database?",
        "Explain database.",
        "Define database.",
        "How do you interact with a database?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/what-is-database\" target=\"_self\" rel=\"\">database</a> is an organized collection of information that can be searched, sorted, and updated. This data is often stored electronically in a computer system called a database management system (DBMS). Oftentimes, you’ll need to use a programming language, such as structured query language (SQL), to interact with your database."
      ]
    },
    {
      "tag": "deep_learning",
      "patterns": [
        "What is deep learning?",
        "Explain deep learning.",
        "Define deep learning.",
        "How do deep neural networks work?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/what-is-deep-learning\" target=\"_self\" rel=\"\">Deep learning</a> is a machine learning technique that layers algorithms and computing units—or neurons—into what is called an artificial neural network (ANN). Unlike machine learning, deep learning algorithms can improve incorrect outcomes through repetition without human intervention. These deep neural networks take inspiration from the structure of the human brain."
      ]
    },
    {
      "tag": "machine_learning",
      "patterns": [
        "What is machine learning?",
        "Explain machine learning.",
        "Define machine learning.",
        "How do machine learning algorithms work?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/types-of-machine-learning\" target=\"_self\" rel=\"\">Machine learning</a> is a subset of AI in which algorithms mimic human learning while processing data. With machine learning, algorithms can improve over time, becoming increasingly accurate when making predictions or classifications. <a href=\"https://www.coursera.org/articles/what-is-machine-learning-engineer\" target=\"_self\" rel=\"\">Machine learning engineers</a> build, design, and maintain AI and machine learning systems."
      ]
    },
    {
      "tag": "relational_database",
      "patterns": [
        "What is a relational database?",
        "Explain relational database.",
        "Define relational database.",
        "How do relational databases work?"
      ],
      "responses": [
        "A <a href=\"https://www.coursera.org/articles/relational-database\" target=\"_self\" rel=\"\">relational database</a> is a database that contains several tables with related information. Even though data is stored in separate tables, you can access related data across several tables with a single query. For example, a relational database may have one table for inventory and another table for customer orders. When you look up a specific product in your relational database, you can retrieve both inventory and customer order information at the same time."
      ]
    },
    {
      "tag": "regression",
      "patterns": [
        "What is regression?",
        "Explain regression.",
        "Define regression.",
        "What algorithms are used for regression?"
      ],
      "responses": [
        "Regression is a machine learning problem that uses data to predict future outcomes. Some examples of algorithms commonly used to create regression models are linear regression and ridge regression."
      ]
    },
    {
      "tag": "reinforcement_learning",
      "patterns": [
        "What is reinforcement learning?",
        "Explain reinforcement learning.",
        "Define reinforcement learning.",
        "How is reinforcement learning used?"
      ],
      "responses": [
        "Reinforcement learning is a type of machine learning that learns by interacting with its environment and getting positive reinforcement for correct predictions and negative reinforcement for incorrect predictions. This type of machine learning may be used to develop autonomous vehicles. Common algorithms are temporal difference, deep adversarial networks, and Q-learning."
      ]
    },
    {
      "tag": "structured_data",
      "patterns": [
        "What is structured data?",
        "Explain structured data.",
        "Define structured data.",
        "Why is structured data easier to analyze?"
      ],
      "responses": [
        "Structured data is formatted data; for example, data that is organized into rows and columns. Structured data is typically easier to analyze than unstructured data because of its tidy formatting."
      ]
    },
    {
      "tag": "structured_query_language",
      "patterns": [
        "What is SQL?",
        "Explain SQL.",
        "Define structured query language.",
        "How is SQL used in databases?"
      ],
      "responses": [
        "Structured Query Language, or <a href=\"https://www.coursera.org/articles/what-does-sql-stand-for\" target=\"_self\" rel=\"\">SQL</a> (pronounced “sequel”), is a computer programming language used to manage relational databases. It’s among the most common languages for database management."
      ]
    },
    {
      "tag": "supervised_learning",
      "patterns": [
        "What is supervised learning?",
        "Explain supervised learning.",
        "Define supervised learning.",
        "How does supervised learning work?"
      ],
      "responses": [
        "Supervised learning is a type of machine learning that learns from labeled historical input and output data. It’s “supervised” because you are feeding it labeled information. This type of machine learning may be used to predict real estate prices or find disease risk factors. Common algorithms used during supervised learning are neural networks, decision trees, linear regression, and support vector machines."
      ]
    },
    {
      "tag": "unstructured_data",
      "patterns": [
        "What is unstructured data?",
        "Explain unstructured data.",
        "Define unstructured data.",
        "How do you analyze unstructured data?"
      ],
      "responses": [
        "<a href=\"https://www.coursera.org/articles/what-is-unstructured-data\" target=\"_self\" rel=\"\">Unstructured data</a> is data that is not organized in any apparent way. In order to analyze unstructured data, you’ll typically need to implement some type of organization."
      ]
    },
    {
      "tag": "unsupervised_learning",
      "patterns": [
        "What is unsupervised learning?",
        "Explain unsupervised learning.",
        "Define unsupervised learning.",
        "How does unsupervised learning work?"
      ],
      "responses": [
        "Unsupervised learning is a machine learning type that looks for data patterns. Unlike supervised learning, unsupervised learning doesn’t learn from labeled data. This type of machine learning is often used to develop predictive models and to create clusters. For example, you can use unsupervised learning to group customers based on purchase behavior, and then make product recommendations based on the purchasing patterns of similar customers. Hidden Markov models, k-means, hierarchical clustering, and Gaussian mixture models are common algorithms used during unsupervised learning."
      ]
    }
  ]
}